{
    "pageTitle": "Denis Quaid",
    "contactMe": "denisq91@gmail.com",
    "social": {
      "linkedIn": "https://uk.linkedin.com/in/denis-quaid-6025b280",
      "github": "https://github.com/denisq1991"
    },
    "about": "I'm an iOS developer based in London with three years experience developing applications using Swift, Objective-C, and Node.js. I am currently working at NET-A-PORTER on the iOS team and have deveoped apps for iPhone, iPad Apple TV.",
    "education": {
          "course": "BSc (Hons) Social Science",
          "university": "University College Cork",
          "date": {
                "start": "September 2010",
                "end": "May 2013"
          },
          "classification": "2.1"
    },
      "masters": {
          "course": "MSc (Hons) Electronic Business",
          "university": "University College Cork",
          "date": {
                "start": "September 203",
                "end": "September 2014"
          },
          "classification": "2.1"
    },
    "mission-statement": {
        "statement" : "Having started my career within a graduate scheme, I was fortunate enough to experience a multitude of different elements of web development before deciding on a career in iOS development. I hope to continue to develop within a team environment and also by working on my own personal projects which allow me to discover and experiment with new technologies. As I gain more experience, I want to bring my enthusiasm and passion for technologies to all teams I work with and make a difference within my team by delivering a best in class application which helps the business to grow as a whole."
    },
    "projects": [
      {
        "name": "Qlimited Instrument Services",
        "type": "Website",
        "description": "This is a project based on creating a new website for the business of a family member, it is made using Node.js, Express and MongoDB and uses a completely custom CMS and backend built by myself. The site has not yet fully launched and therefore contains a lot of test data. It's basically my long-standing side project..",
        "url": "http://qlimited.herokuapp.com/"
      }
    ],
    "work": [
          {
            "company": "Net-a-Porter",
            "role": "Associate iOS Developer",
            "date": {
              "start": "November 2015",
              "end": "..."
            },
            "description": "I am currently working in London as an iOS developer with YOOX NET-A-PORTER in which I am part of the mobile team responsible for the Net-A-Porter iPhone application. My key responsibilities include developing the application within an Agile team using both Objective C and Swift with the Cocoa Touch framework.",
            "projects": [
                 {
                       "description": "Working in a test driven environment to develop the NET-A-PORTER iOS application using Objective C and Swift. Maintaining the current test infrastructure and adding further manual and automated test suites to ensure the quality of each release."
                 },
                 {
                       "description": "Regularly develop side projects in Swift and Node.js to develop and learn new skills and familarise myself with new frameworks. These are available <a href=https://github.com/denisq1991><u>here</u></a> at my Github page."
                 },
                 {
                       "description": "Writing and maintaining shared libraries to interact with a number of RESTful JSON services"
                 },
                 {
                       "description": "Worked within a small group to develop the first shoppable Apple TV application"
                 },
                 {
                       "description": "Using Adobe analytics and other tools to track the user activity and ensure releases are providing measurable value for the business."
                 },
                 {
                       "description": "Contributed to multiple scripts, build tools and applications throughout the company."
                 },
                 {
                       "description":  "Currently redesigning the application to use a tab bar rather than hamburger menu."
                 }
            ],
            "tech": [
            "Swift",
            "Objective-C",
            "Node.js",
            "Cocoa Touch",
            "Cocoa Pods",
            "Git",
            "GOCD",
            "Express JS",
            "MVC",
            "MVVM"
            ],
            "tech2": [
            "UIKit",
            "Facebook iOS",
            "Crashlytics",
            "Google Analytics",
            "Omniture",
            "AFNetworking",
            "AlamoFire"
           ]
          },
          {
            "company": "Net-a-Porter",
            "role": "Graduate Software Engineer",
            "date": {
              "start": "September 2014",
              "end": "March 2015"
            },
            "description": "Created an application in node to dynamically generate a number of sitemaps for different categories and product pages using Node.js and Express.",
            "project_title": "Focus Points & Highlights",
            "projects": [
                 {
                   "description": "Enhanced and maintained several core production backend applications in Perl 5 utilising PostgreSQL, DBIx and the Catalyst MVC Framework. "
                 },
                 {
                   "description": "Worked within an Agile team maintaining a legacy J2EE website using TDD and modern best practice principles."
                 },
                 {
                    "description":  "Worked on various areas of the Mr.Porter web application implementing RESTful API endpoints."
                 },
                 {
                   "description": "Worked on various areas of the Mr.Porter site furniture, adding mobile-first responsive CSS for tablet and desktop versions."
                 }
            ],
            "tech": [
              "Node.js",
              "Java 7",
              "JavaScript",
              "SCSS",
              "CSS",
              "Git",
              "Unix",
              "PostgreSQL",
              "MongoDB",
              "Cucumber"
            ]
          }
    ]
}
